// Задача 49: Задайте двумерный массив. Найдите элементы, у которых оба
//  индекса чётные, и замените эти элементы на их квадраты.
// ​Например, изначально массив
// выглядел вот так:
// 1 4 7 2
// 5 9 2 3
// 8 4 2 4

// Новый массив будет выглядеть
// вот так:
// 1 4 7 2
// 5 81 2 9
// 8 4 2 4

void arrayNumber2D()
{
	int[,] arrayNumbers = new int[7, 7] {
		{1,3, 9, 13, 21, 81, 7},
	 	{5, 7, 0, 13, 7, 33, 41},
	 	{9, 13, 21, 27, 7, 3, 1}, 
	 	{15, 17, 23, 21, 17, 13, 15}, 
	 	{19, 21, 33, 35, 37, 41, 13}, 
	 	{23, 25, 0, 21, 33, 41, 71}, 
	 	{27, 29, 1, 3, 5, 7, 9}};
	for (int i = 0; i < 7; i++)
		for (int j = 0; j < 7; j++)
			if (((i%2)==0)&&((j%2)==0)){
			arrayNumbers[i, j] = arrayNumbers[i, j]*arrayNumbers[i, j];
			}
	for (int i = 0; i < 7; i++)
	{
		for (int j = 0; j < 7; j++)
		{
			Console.Write(arrayNumbers[i, j] + " ");
		}
		Console.WriteLine();
	}

}
arrayNumber2D();